// DOM (Document Object Model) წარმოგვიდგენს ვებ გვერდის სტრუქტურას ობიექტების ხესავით რაც იძლევა JavaScript-ის შესაძლებლობას რომ შევცვალოთ HTML ფაილი მაგ: document.getElementById()

function hello() {
    console.log("Hello World");
}

hello();

function summ() {
    console.log(10 + 10 + 10);
}

summ();

function greet(name = "Friend", age = 15) {
    console.log(`Hello ${name}, you are ${age} years old`);
}

greet();

// 6) განიხილეთ განსხვავება ფუნქციის შექმნის სინტაქსში python'სა და js'ს შორის

// py-ში ფუნქციის შესაქმენალდ ვიყენებთ "def" ხოლო js-ში ვიყენებთ "function"-ს. 
// py-ში არგუმენტის შემდეგ აუცილებელია ორი წერტილი და მის ქვემოთ ინტენტაციით დაწერილი კოდი ითვლება ფუნქციად
// ხოლო js-ში ვიყენეთ ფიგურულ ფრჩხილებს "{}" და შიგნით დაწერილ კოდს არ სჭირდება ინტენტაციის დაცვა ( მაგრამ კოდის მარტივად წაკითხვისთვის უკეთესია ინტენტაციის დაცვა)
// js-ში ვიყენებთ ლეიერის ბოლოს ";" წერტილ მძიმეს 
